Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallTypeError Property
 Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateTaperedWallForWallTypeError { get; }
Public Shared ReadOnly Property CannotCreateTaperedWallForWallTypeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateTaperedWallForWallTypeError {
	FailureDefinitionId^ get ();
}
static member CannotCreateTaperedWallForWallTypeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace